<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006-2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// [ 应用入口文件 ]

// 定义应用目录
define('APP_PATH', __DIR__ . '/../application/');
// 绑定当前访问到index模块
define('BIND_MODULE','admin');  //就是这里，把'index'改成'admin/main'，引号里内容可按三部分划分'模块名/控制器名/方法名'，控制器名和方法名不写则默认为index，这个大家应该很清楚了

// 加载框架引导文件
require __DIR__ . '/../thinkphp/start.php';
